In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.DataFrame(pd.read_csv('/train (1).csv'))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
#we see the shape of the data
df.shape

(891, 12)

In [ ]:
#handling null values
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
#dropping column with 35% null values

drop_col = df.isnull().sum()[df.isnull().sum() > (35/100 * df.shape[0])]
drop_col

Cabin    687
dtype: int64

In [ ]:
#getting the index
drop_col.index

Index(['Cabin'], dtype='object')

In [ ]:
df.drop(drop_col.index, axis = 1, inplace = True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [ ]:
#fill the missing values with mean
df.fillna(df.mean(), inplace = True)

df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [ ]:
df['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [ ]:
#fill with most frequent value
df['Embarked'].fillna('S', inplace = True)

In [ ]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [ ]:
df.corr()

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

In [ ]:
#create a new column family_size by adding sibsp and parch
df['Family_size'] = df['SibSp'] + df['Parch']

In [ ]:
df.drop(['SibSp', 'Parch'], axis=1, inplace=True)
df.shape

(891, 10)

In [ ]:
df.corr()

             PassengerId  Survived    Pclass       Age      Fare  Family_size
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658    -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307     0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500     0.065997
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566    -0.248512
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000     0.217138
Family_size    -0.040143  0.016639  0.065997 -0.248512  0.217138     1.000000

In [ ]:
#add new column alone to check correlation
df['Alone'] = [0 if df['Family_size'] [i] > 0 else 1 for i in df.index]
df.head(20)

    PassengerId  Survived  Pclass  ... Embarked Family_size  Alone
0             1         0       3  ...        S           1      0
1             2         1       1  ...        C           1      0
2             3         1       3  ...        S           0      1
3             4         1       1  ...        S           1      0
4             5         0       3  ...        S           0      1
5             6         0       3  ...        Q           0      1
6             7         0       1  ...        S           0      1
7             8         0       3  ...        S           4      0
8             9         1       3  ...        S           2      0
9            10         1       2  ...        C           1      0
10           11         1       3  ...        S           2      0
11           12         1       1  ...        S           0      1
12           13         0       3  ...        S           0      1
13           14         0       3  ...        S           6      0
14           15         0       3  ...        S           0      1
15           16         1       2  ...        S           0      1
16           17         0       3  ...        Q           5      0
17           18         1       2  ...        S           0      1
18           19         0       3  ...        S           1      0
19           20         1       3  ...        C           0      1

[20 rows x 11 columns]

In [ ]:
df.groupby(['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

In [ ]:
df[['Alone','Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

if the person was not alone, chance that the ticket price is higher is high

In [ ]:
#add a column of sex 1 for female 0 for male

df['Sex'] = [0 if df['Sex'][i] =='male' else 1 for i in df.index]
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

In [ ]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

females were priotised over men
higher class people were also priotised the more
Those who travelled with family had higher chance of survival
Those who boarded at Chebourg survived more than the two other ports